# Data Cleaning Test

In [20]:
import pandas as pd
import numpy as np

df = pd.read_csv('grades.csv')

In [21]:
df.head()

  Last name  First name          SSN  Test1  Test2  Test3  Test4  Final Grade
0   Alfalfa    Aloysius  123-45-6789   40.0   90.0  100.0   83.0   49.0    D-
1    Alfred  University  123-12-1234   41.0   97.0   96.0   97.0   48.0    D+
2     Gerty      Gramma  567-89-0123   41.0   80.0   60.0   40.0   44.0     C
3   Android    Electric  087-65-4321   42.0   23.0   36.0   45.0   47.0    B-
4   Bumpkin        Fred  456-78-9012   43.0   78.0   88.0   77.0   45.0    A-

In [22]:
df.columns

Index(['Last name', 'First name', 'SSN', 'Test1', 'Test2', 'Test3', 'Test4',
       'Final', 'Grade'],
      dtype='object')

In [23]:
df.loc[df['Final']>49]

   Last name First name          SSN  Test1  Test2  Test3  Test4  Final Grade
7       Buff        Bif  632-79-9939   46.0   20.0   30.0   40.0   50.0    B+
8    Airpump     Andrew  223-45-6789   49.0    1.0   90.0  100.0   83.0     A
9     Backus        Jim  143-12-1234   48.0    1.0   97.0   96.0   97.0    A+
12  Elephant        Ima  456-71-9012   45.0    1.0   78.0   88.0   77.0    B-
13  Franklin      Benny  234-56-2890   50.0    1.0   90.0   80.0   90.0    B-

It looks like we've got some bad data here, but assuming our math is right (Which it isn't), these are our top 5 students in the class!